hissokas/udp-stm32f103-wmgmr09/WifiOpen-NoOs_mdk wifi_success/Include/Project.h
/******************************
微嵌电子工作室 版权所有
STM32 WIFI 开发板
适用于微嵌电子“灵通壹号WIFI开发板”
详情请登录 http://yuikin.taobao.com
源代码使用协议：本代码仅提供给客户做学习、或者参考WIFI原理之用，你不能在你发布的产品里面
包含本源代码的完整文件或者部分片段），不能出售或者使用本工作室提供的源代码制作相同类型产品，
例如：开发板、学习板，营利性教学讲座等等，否则视为侵权，本工作室保留追究相关法律责任的权利。
*******************************/

#ifndef __PROJECT_H__
#define __PROJECT_H__

#define WIFI_CMD_SET_IPADDR "set ipaddr 192.168.0.108" //.109"
#define UIP_SET_IPADDR      108 //109
#define HOST_PORT           1400 //1401
#define LOCAL_PORT          1200 //1201

#define BROADCAST_PORT      900 //固定不变

//
// Headers include
//
//-----------------------------------------------------------------------------
// Base Librarys
//-----------------------------------------------------------------------------
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>

#include "stm32f10x.h"
#include "hw_config.h"

#include "BaseTypes.h"
#include "BaseDefs.h"

//-----------------------------------------------------------------------------
// BSP headers
//-----------------------------------------------------------------------------
#include "Board_init.h"

//-----------------------------------------------------------------------------
// Base driver headers
//-----------------------------------------------------------------------------
#include "GSPI.h"
#include "Buzzer.h"
#include "Relay.h"
#include "Flash.h"
#include "Led.h"
#include "Uart.h"
#include "Console.h"

//-----------------------------------------------------------------------------
// System layer headers
//-----------------------------------------------------------------------------
#include "SysClock.h"

//-----------------------------------------------------------------------------
// Wifi reference headers
//-----------------------------------------------------------------------------
#include "WifiDefs.h"
#include "WifiCfg.h"

//-----------------------------------------------------------------------------
// NDIS layer headers
//-----------------------------------------------------------------------------
#include "Ndis.h"
#include "Ndisdef.h"

//-----------------------------------------------------------------------------
// Marvell defined headers
//-----------------------------------------------------------------------------
#include "MrvConstant.h"
#include "MrvStruct.h"
#include "MrvHostCmd.h"

//-----------------------------------------------------------------------------
// Wifi headers
//-----------------------------------------------------------------------------
#include "WlanAdapter.h"
#include "Wifi_Hw.h"
#include "Wifi_If.h"
#include "WlanCmd.h"
#include "WlanInit.h"
#include "WlanPkt.h"
#include "WlanMisc.h"

//-----------------------------------------------------------------------------
// Headers for user
//-----------------------------------------------------------------------------
#include "WifiApiExport.h"
#include "WIFICommand.h"

//-----------------------------------------------------------------------------
// For debug only
//-----------------------------------------------------------------------------
#include "UartTrace.h"

//
// Global variables declare
//
extern WLAN_ADAPTER g_Adapter;

#endif // __PROJECT_H__
